Autodesk.Revit.DB.RevisionNumberingSequence.CreateAlphanumericSequence(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.AlphanumericRevisionSettings)
Creates a new alphanumeric revision numbering sequence in the document.
Remarks:
The new revision numbering sequence will not be assigned to any revision.
Use `Revision.SetRevisionNumberingSequenceId` to apply the sequence to a revision.
document:
The document of the new revision numbering sequence.
name:
The name for the revision numbering sequence.
settings:
The alphanumeric settings for the revision numbering sequence.
Returns:
The newly created revision numbering sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
settings is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.CreateNumericSequence(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.NumericRevisionSettings)
Creates a new numeric revision numbering sequence in the document.
Remarks:
The new revision numbering sequence will not be assigned to any revision.
Use `Revision.SetRevisionNumberingSequenceId` to apply the sequence to a revision.
document:
The document of the new revision numbering sequence.
name:
The name for the revision numbering sequence.
settings:
The numeric settings for the revision numbering sequence.
Returns:
The newly created revision numbering sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
settings is not a valid NumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022

Autodesk.Revit.DB.RevisionNumberingSequence.SequenceName
The name of this revision numbering sequence.
Remarks:
This name appears in the Sheet Issues/Revisions dialog as a numbering choice for each revision.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sequenceName is an empty string or contains only whitespace.
-or-
When setting this property: sequenceName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022